In [173]:
# import dependencies :
import pandas as pd 
import math

In [175]:
from joblib import load

In [177]:
# Loading the saved DataFrame for model training 
df = load('df_fe.joblib')

In [179]:
df

     age  years_of_experience  salary  gender_male  education_level  job_title
0     32                    5   90000            1                2        159
1     28                    3   65000            0                1         17
2     45                   15  150000            1                0        130
3     36                    7   60000            0                2        101
4     52                   20  200000            1                1         22
..   ...                  ...     ...          ...              ...        ...
348   28                    1   35000            0                2         68
349   36                    8  110000            1                2        111
350   44                   16  160000            0                0        115
351   31                    3   55000            1                2         63
371   43                   19  170000            1                1         30

[324 rows x 6 columns]

# Preparing for model training

In [255]:
from sklearn.model_selection import train_test_split
X = df.drop(columns=['salary','job_title'], axis=1)
y = df['salary']

x_train, x_test, y_train, y_test = train_test_split(X,y, test_size=0.2, random_state=42)

In [257]:
X

     age  years_of_experience  gender_male  education_level
0     32                    5            1                2
1     28                    3            0                1
2     45                   15            1                0
3     36                    7            0                2
4     52                   20            1                1
..   ...                  ...          ...              ...
348   28                    1            0                2
349   36                    8            1                2
350   44                   16            0                0
351   31                    3            1                2
371   43                   19            1                1

[324 rows x 4 columns]

In [259]:
y

0       90000
1       65000
2      150000
3       60000
4      200000
        ...
348     35000
349    110000
350    160000
351     55000
371    170000
Name: salary, Length: 324, dtype: int32

In [261]:
x_train

     age  years_of_experience  gender_male  education_level
73    28                    2            1                2
182   44                   15            0                0
17    39                   12            1                0
24    41                   13            1                1
146   42                   16            0                0
..   ...                  ...          ...              ...
189   28                    1            1                2
71    39                   11            0                2
106   30                    3            0                2
284   35                    9            1                2
102   49                   19            0                1

[259 rows x 4 columns]

# Linear Regression Model :

In [291]:
from sklearn.linear_model import LinearRegression

model = LinearRegression()
model.fit(x_train,y_train)
predictions = model.predict(x_test)

In [293]:
# Model Accuracy : 
from sklearn.metrics import mean_absolute_error, mean_squared_error, r2_score
mae = mean_absolute_error(y_test, predictions)
mse = mean_squared_error(y_test, predictions)
r2 = r2_score(y_test, predictions)

In [295]:
print(mae)
print(mse)
print(r2)

10484.142208579335
204957036.7887117
0.8915448996559135

In [165]:
# It is almost same : Therefore, I will remove job_title and use X without job_title column

In [167]:
## Prediction on the new data :

In [169]:
# Inputs to the model : age	years_of_experience	gender_male	education_level

In [299]:
age_new_data = int(input("Enter the Age of the employee : "))
years_of_experience_new_data = int(input("Enter the years of experience in integer format : "))
gender_male_new_data = bool(input("Is the employee Male? (Ans: True or False) : "))
gender_male_new_data = int(gender_male_new_data)
educational_level_new_data = int(input("Education Level of the employee : Enter 0 for Phd, 1 for Master's, 2 for Bachleor's : "))

Enter the Age of the employee :  21
Enter the years of experience in integer format :  0
Is the employee Male? (Ans: True or False) :  False
Education Level of the employee : Enter 0 for Phd, 1 for Master's, 2 for Bachleor's :  2

In [301]:
# COnvert the input into array : 
new_data = [[age_new_data, years_of_experience_new_data, gender_male_new_data, educational_level_new_data]]

In [303]:
prediction_new = model.predict(new_data)

C:\Users\SAMSUNG\anaconda3\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

In [305]:
expected_salary = math.ceil(prediction_new[0])

In [307]:
print(f"The expected Salary based of your data is : ₹/${expected_salary}")

The expected Salary based of your data is : ₹/$19901